daqinxiaren/companyProgramCode/clb_app/rtos/bsp/stm32/drivers/drv_usart.c
/*
 * Copyright (c) 2006-2018, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2018-10-30     SummerGift   first version
 * 2020-03-16     SummerGift   add device close feature
 * 2020-03-20     SummerGift   fix bug caused by ORE
 * 2020-05-02     whj4674672   support stm32h7 uart dma
 * 2020-10-14     Dozingfiretruck   Porting for stm32wbxx
 */


#include "drv_usart.h"
#ifdef ENABLE_SERIAL
#include "drv_config.h"

//#define DRV_DEBUG
//#define LOG_TAG             "drv.usart"
#include <drv_log.h>

#if !defined(ENABLE_UART1) && !defined(ENABLE_UART2) && !defined(ENABLE_UART3) && \
    !defined(ENABLE_UART4) && !defined(ENABLE_UART5) && !defined(ENABLE_UART6) && \
    !defined(ENABLE_UART7) && !defined(ENABLE_UART8) && !defined(ENABLE_LPUART1)
#error "Please define at least one ENABLE_UARTx"
/* this driver can be disabled at menuconfig -> RT-Thread Components -> Device Drivers */
#endif

#ifdef DEV_SERIAL_ENABLE_DMA
static void stm32_dma_config(struct rt_serial_device *serial, rt_ubase_t flag);
#endif

enum
{
#ifdef ENABLE_UART1
    UART1_INDEX,
#endif
#ifdef ENABLE_UART2
    UART2_INDEX,
#endif
#ifdef ENABLE_UART3
    UART3_INDEX,
#endif
#ifdef ENABLE_UART4
    UART4_INDEX,
#endif
#ifdef ENABLE_UART5
    UART5_INDEX,
#endif
#ifdef ENABLE_UART6
    UART6_INDEX,
#endif
#ifdef ENABLE_UART7
    UART7_INDEX,
#endif
#ifdef ENABLE_UART8
    UART8_INDEX,
#endif
#ifdef ENABLE_LPUART1
    LPUART1_INDEX,
#endif
};

static struct stm32_uart_config uart_config[] =
{
#ifdef ENABLE_UART1
    UART1_CONFIG,
#endif
#ifdef ENABLE_UART2
    UART2_CONFIG,
#endif
#ifdef ENABLE_UART3
    UART3_CONFIG,
#endif
#ifdef ENABLE_UART4
    UART4_CONFIG,
#endif
#ifdef ENABLE_UART5
    UART5_CONFIG,
#endif
#ifdef ENABLE_UART6
    UART6_CONFIG,
#endif
#ifdef ENABLE_UART7
    UART7_CONFIG,
#endif
#ifdef ENABLE_UART8
    UART8_CONFIG,
#endif
#ifdef ENABLE_LPUART1
    LPUART1_CONFIG,
#endif
};

static struct stm32_uart uart_obj[sizeof(uart_config) / sizeof(uart_config[0])] = {0};

static rt_err_t stm32_configure(struct rt_serial_device *serial, struct serial_configure *cfg)
{
    struct stm32_uart *uart;
    OS_ASSERT(serial != OS_NULL);
    OS_ASSERT(cfg != OS_NULL);

    uart = rt_container_of(serial, struct stm32_uart, serial);
    uart->handle.Instance          = uart->config->Instance;
    uart->handle.Init.BaudRate     = cfg->baud_rate;
    uart->handle.Init.HwFlowCtl    = UART_HWCONTROL_NONE;
    uart->handle.Init.Mode         = UART_MODE_TX_RX;
    uart->handle.Init.OverSampling = UART_OVERSAMPLING_16;

    switch (cfg->data_bits)
    {
    case DATA_BITS_8:
        uart->handle.Init.WordLength = UART_WORDLENGTH_8B;
        break;
    case DATA_BITS_9:
        uart->handle.Init.WordLength = UART_WORDLENGTH_9B;
        break;
    default:
        uart->handle.Init.WordLength = UART_WORDLENGTH_8B;
        break;
    }

    switch (cfg->stop_bits)
    {
    case STOP_BITS_1:
        uart->handle.Init.StopBits   = UART_STOPBITS_1;
        break;
    case STOP_BITS_2:
        uart->handle.Init.StopBits   = UART_STOPBITS_2;
        break;
    default:
        uart->handle.Init.StopBits   = UART_STOPBITS_1;
        break;
    }

    switch (cfg->parity)
    {
    case PARITY_NONE:
        uart->handle.Init.Parity     = UART_PARITY_NONE;
        break;
    case PARITY_ODD:
        uart->handle.Init.Parity     = UART_PARITY_ODD;
        break;
    case PARITY_EVEN:
        uart->handle.Init.Parity     = UART_PARITY_EVEN;
        break;
    default:
        uart->handle.Init.Parity     = UART_PARITY_NONE;
        break;
    }

#ifdef DEV_SERIAL_ENABLE_DMA
    uart->dma_rx.last_index = 0;
#endif

    if (HAL_UART_Init(&uart->handle) != HAL_OK)
    {
        return -OS_ERROR;
    }

    return OS_EOK;
}

static rt_err_t stm32_control(struct rt_serial_device *serial, int cmd, void *arg)
{
    struct stm32_uart *uart;
#ifdef DEV_SERIAL_ENABLE_DMA
    rt_ubase_t ctrl_arg = (rt_ubase_t)arg;
#endif

    OS_ASSERT(serial != OS_NULL);
    uart = rt_container_of(serial, struct stm32_uart, serial);

    switch (cmd)
    {
    /* disable interrupt */
    case DEVICE_CTRL_CLR_INT:
        /* disable rx irq */
        NVIC_DisableIRQ(uart->config->irq_type);
        /* disable interrupt */
        __HAL_UART_DISABLE_IT(&(uart->handle), UART_IT_RXNE);

#ifdef DEV_SERIAL_ENABLE_DMA
        /* disable DMA */
        if (ctrl_arg == DEVICE_FLAG_DMA_RX)
        {
            HAL_NVIC_DisableIRQ(uart->config->dma_rx->dma_irq);
            if (HAL_DMA_Abort(&(uart->dma_rx.handle)) != HAL_OK)
            {
                OS_ASSERT(0);
            }

            if (HAL_DMA_DeInit(&(uart->dma_rx.handle)) != HAL_OK)
            {
                OS_ASSERT(0);
            }
        }
        else if(ctrl_arg == DEVICE_FLAG_DMA_TX)
        {
            HAL_NVIC_DisableIRQ(uart->config->dma_tx->dma_irq);
            if (HAL_DMA_DeInit(&(uart->dma_tx.handle)) != HAL_OK)
            {
                OS_ASSERT(0);
            }
        }
#endif
        break;

    /* enable interrupt */
    case DEVICE_CTRL_SET_INT:
        /* enable rx irq */
        HAL_NVIC_SetPriority(uart->config->irq_type, 1, 0); 
        HAL_NVIC_EnableIRQ(uart->config->irq_type);
        /* enable interrupt */
        __HAL_UART_ENABLE_IT(&(uart->handle), UART_IT_RXNE);
        break;

#ifdef DEV_SERIAL_ENABLE_DMA
    case DEVICE_CTRL_CONFIG:
        stm32_dma_config(serial, ctrl_arg);
        break;
#endif

    case DEVICE_CTRL_CLOSE:
        if (HAL_UART_DeInit(&(uart->handle)) != HAL_OK )
        {
            OS_ASSERT(0)
        }
        break;

    }
    return OS_EOK;
}

static int stm32_putc(struct rt_serial_device *serial, char c)
{
    struct stm32_uart *uart;
    OS_ASSERT(serial != OS_NULL);

    uart = rt_container_of(serial, struct stm32_uart, serial);
    UART_INSTANCE_CLEAR_FUNCTION(&(uart->handle), UART_FLAG_TC);
#if defined(STM32L4XX) || defined(STM32F7XX) || defined(STM32F0XX) \
    || defined(STM32L0XX) || defined(STM32G0XX) || defined(STM32H7XX) \
    || defined(STM32G4XX) || defined(SOC_SERIES_STM32MP1) || defined(SOC_SERIES_STM32WB)
    uart->handle.Instance->TDR = c;
#else
    uart->handle.Instance->DR = c;
#endif
    while (__HAL_UART_GET_FLAG(&(uart->handle), UART_FLAG_TC) == RESET);
    return 1;
}

