daqinxiaren/companyProgramCode/clb_app/rtos/bsp/stm32/drivers/drv_usart.c
#if defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART4_TX_ENABLE_DMA)
void UART4_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&uart_obj[UART4_INDEX].dma_tx.handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(BSP_UART_ENABLE_DMA_TX) && defined(BSP_UART4_TX_ENABLE_DMA) */
#endif /* ENABLE_UART4*/

#if defined(ENABLE_UART5)
void UART5_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    uart_isr(&(uart_obj[UART5_INDEX].serial));

    /* leave interrupt */
    rt_interrupt_leave();
}
#if defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART5_RX_ENABLE_DMA)
void UART5_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&uart_obj[UART5_INDEX].dma_rx.handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART5_RX_ENABLE_DMA) */
#if defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART5_TX_ENABLE_DMA)
void UART5_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&uart_obj[UART5_INDEX].dma_tx.handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART5_TX_ENABLE_DMA) */
#endif /* ENABLE_UART5*/

#if defined(ENABLE_UART6)
void USART6_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    uart_isr(&(uart_obj[UART6_INDEX].serial));

    /* leave interrupt */
    rt_interrupt_leave();
}
#if defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART6_RX_ENABLE_DMA)
void UART6_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&uart_obj[UART6_INDEX].dma_rx.handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART6_RX_ENABLE_DMA) */
#if defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART6_TX_ENABLE_DMA)
void UART6_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&uart_obj[UART6_INDEX].dma_tx.handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART6_TX_ENABLE_DMA) */
#endif /* ENABLE_UART6*/

#if defined(ENABLE_UART7)
void UART7_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    uart_isr(&(uart_obj[UART7_INDEX].serial));

    /* leave interrupt */
    rt_interrupt_leave();
}
#if defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART7_RX_ENABLE_DMA)
void UART7_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&uart_obj[UART7_INDEX].dma_rx.handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART7_RX_ENABLE_DMA) */
#if defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART7_TX_ENABLE_DMA)
void UART7_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&uart_obj[UART7_INDEX].dma_tx.handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART7_TX_ENABLE_DMA) */
#endif /* ENABLE_UART7*/

#if defined(ENABLE_UART8)
void UART8_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    uart_isr(&(uart_obj[UART8_INDEX].serial));

    /* leave interrupt */
    rt_interrupt_leave();
}
#if defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART8_RX_ENABLE_DMA)
void UART8_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&uart_obj[UART8_INDEX].dma_rx.handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART8_RX_ENABLE_DMA) */
#if defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART8_TX_ENABLE_DMA)
void UART8_DMA_TX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&uart_obj[UART8_INDEX].dma_tx.handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_UART8_TX_ENABLE_DMA) */
#endif /* ENABLE_UART8*/

#if defined(ENABLE_LPUART1)
void LPUART1_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    uart_isr(&(uart_obj[LPUART1_INDEX].serial));

    /* leave interrupt */
    rt_interrupt_leave();
}
#if defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_LPUART1_RX_ENABLE_DMA)
void LPUART1_DMA_RX_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    HAL_DMA_IRQHandler(&uart_obj[LPUART1_INDEX].dma_rx.handle);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* defined(DEV_SERIAL_ENABLE_DMA) && defined(BSP_LPUART1_RX_ENABLE_DMA) */
#endif /* ENABLE_LPUART1*/

static void stm32_uart_get_dma_config(void)
{
#ifdef ENABLE_UART1
    uart_obj[UART1_INDEX].uart_dma_flag = 0;
#ifdef BSP_UART1_RX_ENABLE_DMA
    uart_obj[UART1_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_RX;
    static struct dma_config uart1_dma_rx = UART1_DMA_RX_CONFIG;
    uart_config[UART1_INDEX].dma_rx = &uart1_dma_rx;
#endif
#ifdef BSP_UART1_TX_ENABLE_DMA
    uart_obj[UART1_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_TX;
    static struct dma_config uart1_dma_tx = UART1_DMA_TX_CONFIG;
    uart_config[UART1_INDEX].dma_tx = &uart1_dma_tx;
#endif
#endif

#ifdef ENABLE_UART2
    uart_obj[UART2_INDEX].uart_dma_flag = 0;
#ifdef BSP_UART2_RX_ENABLE_DMA
    uart_obj[UART2_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_RX;
    static struct dma_config uart2_dma_rx = UART2_DMA_RX_CONFIG;
    uart_config[UART2_INDEX].dma_rx = &uart2_dma_rx;
#endif
#ifdef BSP_UART2_TX_ENABLE_DMA
    uart_obj[UART2_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_TX;
    static struct dma_config uart2_dma_tx = UART2_DMA_TX_CONFIG;
    uart_config[UART2_INDEX].dma_tx = &uart2_dma_tx;
#endif
#endif

#ifdef ENABLE_UART3
    uart_obj[UART3_INDEX].uart_dma_flag = 0;
#ifdef BSP_UART3_RX_ENABLE_DMA
    uart_obj[UART3_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_RX;
    static struct dma_config uart3_dma_rx = UART3_DMA_RX_CONFIG;
    uart_config[UART3_INDEX].dma_rx = &uart3_dma_rx;
#endif
#ifdef BSP_UART3_TX_ENABLE_DMA
    uart_obj[UART3_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_TX;
    static struct dma_config uart3_dma_tx = UART3_DMA_TX_CONFIG;
    uart_config[UART3_INDEX].dma_tx = &uart3_dma_tx;
#endif
#endif

#ifdef ENABLE_UART4
    uart_obj[UART4_INDEX].uart_dma_flag = 0;
#ifdef BSP_UART4_RX_ENABLE_DMA
    uart_obj[UART4_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_RX;
    static struct dma_config uart4_dma_rx = UART4_DMA_RX_CONFIG;
    uart_config[UART4_INDEX].dma_rx = &uart4_dma_rx;
#endif
#ifdef BSP_UART4_TX_ENABLE_DMA
    uart_obj[UART4_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_TX;
    static struct dma_config uart4_dma_tx = UART4_DMA_TX_CONFIG;
    uart_config[UART4_INDEX].dma_tx = &uart4_dma_tx;
#endif
#endif

#ifdef ENABLE_UART5
    uart_obj[UART5_INDEX].uart_dma_flag = 0;
#ifdef BSP_UART5_RX_ENABLE_DMA
    uart_obj[UART5_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_RX;
    static struct dma_config uart5_dma_rx = UART5_DMA_RX_CONFIG;
    uart_config[UART5_INDEX].dma_rx = &uart5_dma_rx;
#endif
#ifdef BSP_UART5_TX_ENABLE_DMA
    uart_obj[UART5_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_TX;
    static struct dma_config uart5_dma_tx = UART5_DMA_TX_CONFIG;
    uart_config[UART5_INDEX].dma_tx = &uart5_dma_tx;
#endif
#endif

#ifdef ENABLE_UART6
    uart_obj[UART6_INDEX].uart_dma_flag = 0;
#ifdef BSP_UART6_RX_ENABLE_DMA
    uart_obj[UART6_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_RX;
    static struct dma_config uart6_dma_rx = UART6_DMA_RX_CONFIG;
    uart_config[UART6_INDEX].dma_rx = &uart6_dma_rx;
#endif
#ifdef BSP_UART6_TX_ENABLE_DMA
    uart_obj[UART6_INDEX].uart_dma_flag |= DEVICE_FLAG_DMA_TX;
    static struct dma_config uart6_dma_tx = UART6_DMA_TX_CONFIG;
    uart_config[UART6_INDEX].dma_tx = &uart6_dma_tx;
#endif
#endif
}

#ifdef DEV_SERIAL_ENABLE_DMA
static void stm32_dma_config(struct rt_serial_device *serial, rt_ubase_t flag)
{
    struct rt_serial_rx_fifo *rx_fifo;
    DMA_HandleTypeDef *DMA_Handle;
    struct dma_config *dma_config;
    struct stm32_uart *uart;

